Tekla Open API Reference for Tekla Structures 2025
Polygon.Bulges Property
 The list of individual bulges for the polygon.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<double> Bulges { get; set; }
Public Property Bulges As List(Of Double)
	Get
	Set
Property Value
Type: List<Double>
See Also
Reference
Polygon Class
Tekla.Structures.Drawing Namespace